//CMFLOF2A         JOB
/* EXECUTE VSAM DATA LOAD PROGRAM
/*
//CMFLOAD  EXEC PGM=CMFLOF2A
/*
//STEPLIB  DD DSN=KC03F2A.DCMAFD02.COBOL.LOADLIB,DISP=SHR
//CMFDATA  DD DSN=KC03F2A.DCMAFD02.A5P1.CMF.DATA,DISP=SHR
//OUTFILE  DD DSN=KC03F2A.DCMAFD02.A5P1.CICS.CMFF2A,DISP=SHR
/*